Res-firecracker-random-v66/firecracker_t_4_c_6_frontVcpu_4_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5170.885ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5132.550ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 5202.594ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 4899.779ms, rate sampling interval: 15826ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.54s    12.46s   42.93s    47.24%
    Req/Sec   280.00      2.36   283.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.25s 
 75.000%   37.55s 
 90.000%   41.45s 
 99.000%   42.93s 
 99.900%   43.35s 
 99.990%   43.52s 
 99.999%   43.52s 
100.000%   43.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8216.575     0.000000            2         1.00
   10018.815     0.100000         5598         1.11
   10723.327     0.200000        11193         1.25
   13066.239     0.300000        16776         1.43
   19759.103     0.400000        22367         1.67
   26247.167     0.500000        27962         2.00
   29179.903     0.550000        30757         2.22
   32342.015     0.600000        33546         2.50
   35553.279     0.650000        36353         2.86
   36798.463     0.700000        39162         3.33
   37552.127     0.750000        42041         4.00
   38076.415     0.775000        43335         4.44
   38862.847     0.800000        44727         5.00
   40337.407     0.825000        46132         5.71
   40763.391     0.850000        47534         6.67
   41123.839     0.875000        48962         8.00
   41287.679     0.887500        49637         8.89
   41451.519     0.900000        50389        10.00
   41615.359     0.912500        51130        11.43
   41779.199     0.925000        51817        13.33
   41943.039     0.937500        52436        16.00
   42041.343     0.943750        52821        17.78
   42139.647     0.950000        53191        20.00
   42237.951     0.956250        53535        22.86
   42336.255     0.962500        53824        26.67
   42467.327     0.968750        54231        32.00
   42532.863     0.971875        54390        35.56
   42598.399     0.975000        54555        40.00
   42663.935     0.978125        54735        45.71
   42729.471     0.981250        54906        53.33
   42795.007     0.984375        55054        64.00
   42827.775     0.985938        55118        71.11
   42893.311     0.987500        55270        80.00
   42926.079     0.989062        55346        91.43
   42958.847     0.990625        55400       106.67
   43024.383     0.992188        55495       128.00
   43057.151     0.992969        55545       142.22
   43089.919     0.993750        55585       160.00
   43122.687     0.994531        55627       182.86
   43155.455     0.995313        55663       213.33
   43188.223     0.996094        55700       256.00
   43220.991     0.996484        55740       284.44
   43220.991     0.996875        55740       320.00
   43253.759     0.997266        55758       365.71
   43286.527     0.997656        55787       426.67
   43319.295     0.998047        55817       512.00
   43319.295     0.998242        55817       568.89
   43319.295     0.998437        55817       640.00
   43352.063     0.998633        55849       731.43
   43352.063     0.998828        55849       853.33
   43352.063     0.999023        55849      1024.00
   43384.831     0.999121        55866      1137.78
   43384.831     0.999219        55866      1280.00
   43384.831     0.999316        55866      1462.86
   43417.599     0.999414        55875      1706.67
   43417.599     0.999512        55875      2048.00
   43450.367     0.999561        55884      2275.56
   43450.367     0.999609        55884      2560.00
   43450.367     0.999658        55884      2925.71
   43483.135     0.999707        55893      3413.33
   43483.135     0.999756        55893      4096.00
   43483.135     0.999780        55893      4551.11
   43483.135     0.999805        55893      5120.00
   43483.135     0.999829        55893      5851.43
   43515.903     0.999854        55902      6826.67
   43515.903     1.000000        55902          inf
#[Mean    =    25542.317, StdDeviation   =    12455.226]
#[Max     =    43483.136, Total count    =        55902]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  66386 requests in 1.00m, 27.46MB read
Requests/sec:   1106.39
Transfer/sec:    468.61KB